# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

# Пример:

# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]

list = [2, 3, 4, 5, 6, 9, 4, 7]
new_list = []
for i in range((len(list)+1)//2):
    new_list.append(list[i]*list[len(list)-1-i])
print(f'- {list} => {new_list}')